create database SSM;
/*
Navicat MySQL Data Transfer

Source Server         : 127.0.01
Source Server Version : 50045
Source Host           : localhost:3306
Source Database       : book

Target Server Type    : MYSQL
Target Server Version : 50045
File Encoding         : 65001

Date: 2019-08-20 14:11:48
*/
use SSM;
SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for book
-- ----------------------------
DROP TABLE IF EXISTS `book`;
CREATE TABLE `book` (
                        `id` int(11) NOT NULL auto_increment,
                        `name` varchar(255) default NULL,
                        `author` varchar(255) default NULL,
                        `publish` varchar(255) default NULL,
                        `publishdate` date default NULL,
                        `page` int(11) default NULL,
                        `price` double default NULL,
                        `content` varchar(255) default NULL,
                        PRIMARY KEY  (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=241 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of book
-- ----------------------------
INSERT INTO `book` VALUES ('12', '西游记', '吴承恩', '南天门出版社', '2019-05-16', '100', '250', '西游记');
INSERT INTO `book` VALUES ('13', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('14', '三国演义', '罗贯中', '北大出版11', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('15', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('16', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('17', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('18', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('19', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('20', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('21', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('22', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('23', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('24', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('25', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('26', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('27', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('28', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('29', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('30', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('31', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('32', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('33', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('34', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('35', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('36', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('37', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('38', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('39', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('40', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('41', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('42', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('43', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('44', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('45', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('47', '456789', '456789', '456789', '2019-06-12', '200', '250', '456789');
INSERT INTO `book` VALUES ('48', '三国演义', '马伯庸', '不知道', '2018-01-01', '400', '31', '死囚犯的撩妹之旅');
INSERT INTO `book` VALUES ('51', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('52', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('53', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('54', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('55', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('56', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('57', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('58', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('59', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('60', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('61', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('62', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('63', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('64', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('65', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('66', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('67', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('68', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('69', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('70', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('71', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('72', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('73', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('74', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('75', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('76', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('77', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('78', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('79', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('80', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('81', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('82', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('83', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('84', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('85', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('86', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('87', '456789', '456789', '456789', '2019-06-12', '200', '250', '456789');
INSERT INTO `book` VALUES ('88', '长安十二时辰', '马伯庸', '不知道', '2018-01-01', '400', '31', '死囚犯的撩妹之旅');
INSERT INTO `book` VALUES ('89', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('90', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('91', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('92', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('93', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('94', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('95', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('96', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('97', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('98', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('99', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('100', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('101', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('102', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('103', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('104', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('105', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('106', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('107', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('108', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('109', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('110', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('111', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('112', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('113', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('114', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('115', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('116', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('117', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('118', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('119', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('120', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('121', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('122', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('123', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('124', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('125', '456789', '456789', '456789', '2019-06-12', '200', '250', '456789');
INSERT INTO `book` VALUES ('126', '三国演义', '马伯庸', '不知道', '2018-01-01', '400', '31', '死囚犯的撩妹之旅');
INSERT INTO `book` VALUES ('127', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('128', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('129', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('130', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('131', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('132', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('133', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('134', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('135', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('136', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('137', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('138', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('139', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('140', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('141', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('142', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('143', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('144', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('145', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('146', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('147', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('148', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('149', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('150', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('151', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('152', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('153', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('154', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('155', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('156', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('157', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('158', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('159', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('160', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('161', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('162', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('163', '456789', '456789', '456789', '2019-06-12', '200', '250', '456789');
INSERT INTO `book` VALUES ('164', '长安十二时辰', '马伯庸', '不知道', '2018-01-01', '400', '31', '死囚犯的撩妹之旅');
INSERT INTO `book` VALUES ('165', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('166', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('167', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('168', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('169', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('170', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('171', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('172', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('173', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('174', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('175', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('176', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('177', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('178', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('179', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('180', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('181', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('182', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('183', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('184', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('185', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('186', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('187', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('188', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('189', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('190', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('191', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('192', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('193', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('194', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('195', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('196', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('197', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('198', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('199', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('200', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('201', '456789', '456789', '456789', '2019-06-12', '200', '250', '456789');
INSERT INTO `book` VALUES ('202', '三国演义', '马伯庸', '不知道', '2018-01-01', '400', '31', '死囚犯的撩妹之旅');
INSERT INTO `book` VALUES ('203', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('204', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('205', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('206', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('207', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('208', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('209', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('210', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('211', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('212', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('213', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('214', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('215', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('216', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('217', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('218', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('219', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('220', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('221', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('222', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('223', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('224', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('225', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('226', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('227', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('228', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('229', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('230', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('231', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('232', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('233', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('234', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('235', '西游记', '吴承恩', '南天门出版', '2019-05-16', '81', '108', '一个王者猴子带四个青铜的升级打怪历程');
INSERT INTO `book` VALUES ('236', '水浒传', '施耐庵', '梁山出版', '1695-07-13', '108', '108', '105个大汉和3个女人的故事');
INSERT INTO `book` VALUES ('237', '红楼梦', '曹雪芹', '大观园出版', '1939-05-16', '250', '250', '两块石头的爱恨情仇');
INSERT INTO `book` VALUES ('238', '三国演义', '罗贯中', '北大出版', '1790-06-23', '200', '200', '天下大势，分久必合，合久必分');
INSERT INTO `book` VALUES ('240', '长安十二时辰', '马伯庸', '不知道', '2018-01-01', '400', '31', '死囚犯的撩妹之旅');

-- ----------------------------
-- Table structure for role
-- ----------------------------
DROP TABLE IF EXISTS `role`;
CREATE TABLE `role` (
                        `id` int(11) default NULL,
                        `rolename` varchar(255) default NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of role
-- ----------------------------
INSERT INTO `role` VALUES ('1', '超级管理员');
INSERT INTO `role` VALUES ('2', '管理员');
INSERT INTO `role` VALUES ('3', '校长');
INSERT INTO `role` VALUES ('4', '行政官');
INSERT INTO `role` VALUES ('5', '军长');

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
                         `id` int(11) NOT NULL auto_increment,
                         `name` varchar(255) default NULL,
                         `password` varchar(255) default NULL,
                         `age` int(11) default NULL,
                         `sex` int(11) default NULL,
                         `nickname` varchar(255) default NULL,
                         `usertype` int(11) default NULL,
                         `roleid` int(11) default NULL,
                         PRIMARY KEY  (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES ('1', 'aa', '654321', '25', '1', '1', null, '1');
INSERT INTO `users` VALUES ('3', '赵六', '456789', '78', '0', '2', null, '2');
INSERT INTO `users` VALUES ('4', '张三', '123456', '6', '1', '3', null, '3');
INSERT INTO `users` VALUES ('5', '王五', '789456', '45', '1', '4', null, '4');
