/*
        _                         _             
                                        (_)                       | |            
                     __ _   __ _ __   __ _  _ __    ___  ___    __| |  ___  _ __ 
                    / _` | / _` |\ \ / /| || '_ \  / __|/ _ \  / _` | / _ \| '__|
                   | (_| || (_| | \ V / | || | | || (__| (_) || (_| ||  __/| |   
                    \__, | \__,_|  \_/  |_||_| |_| \___|\___/  \__,_| \___||_|   
                     __/ |                                                       
                    |___/  


*/

package 面向对象;

/**
 * 编写宠物狗类，里面的属性有：名称、性别、种类，
 * 里面的方法有：吃、喝、睡、跑，每个方法里面打印出一句话即可，
 * 例如在吃的方法中，打印出“我喜欢吃骨头”。最后会用main方法进行测试。
 */
public class Dog extends Pet {
    @Override
    public void eat(){

        System.out.println("我吃骨头 ");

    }
   
}
